def getHashtagMessage(hashtag):
    if hashtag == "가족":
        message = """
            가족을 항상 우선시 하는 당신, 온라인에서도 가족을 생각하시는 가족과의 시간을 많이 보내는 사람이군요. 
            가족 해시태그를 많이 이용하는 사람들은 주변사람의 소소한 이야기를 모두 기억합니다. 
            타고난 섬세함으로 마음을 표현함에 있어 상대방의 가슴을 진심으로 울리는 데 천부적인 재능이있습니다. 
            또한 타인을 향한 연민이나 동정심이 있으면서도 가족이나 친구를 보호해야 할 때는 가차 없는 모습을 보이기도 합니다. 
            화목한 가정을 꾸려 나가는 것을 옆에서 지켜보는 것 자체가 당신을 지켜보는 친구들에게는 큰 축복일 것입니다. 
        """
    elif hashtag == "감정":
        message = """
            철이 없었죠, 새벽에 인스타를 켰다는거 자체가 - 최준,  
            감정적인 태그를 많이 남기는 당신은 사람들 행동에 많은 관심을 가지며 타인에게 잘 동조한다는 특징이 있습니다.  
            하지만 가끔은 자신이 왜 화났는지 모르는 일이 많습니다 그럴때 SNS를 통해 자신을 감정 드러내며 안정감을 얻으시는 군요. 
            당신의 섬세함을 살려 다른 사람의 상황에도 깊게 공감하다 보면 당신이 힘들때 주변에서 먼저 연락하며 기쁜일이 있을 때도 같이 축하하는 평생의 친구를 만드실수 있을 것입니다. 
        """
    elif hashtag == "공부스타그램":
        message = """
            기회는 일어나는 것이 아니라 만들어내는 것이다 -크리스 그로서,  
            공부와 관련된 태그를 많이 남기는 당신은 준비하는 일이 끝날때 까지 끈기있는 모습을 유지하고 다른 사람에게 공유함을 통해 해이해지지 않으려 노력하는 편입니다.  
            열심히 공부한 당신은 가끔의 휴식시간에도 다른 사람들이 앞서고 있다는 마음에 쉬는걸 미루려 하는 모습도 보이십니다. 
            하지만 가끔의 휴식을 통해 지금까지 쌓아온 불안감 가득했던 마음은 비우고, 열정으로 한가득 채워넣을 수 있을 것입니다. 
            지금까지의 노력이 결실을 맺어 원하는 일을 거두실 수 있기를 당신의 친구들도 응원할 것입니다.  
        """
    elif hashtag == "그림":
        message = """
            예술적 조예가 깊은 당신! 혹시 인스타 밥 아저씨아니신가요?  
            그림과 관련된 태그를 많이 남기는 당신은 자신이 그린 그림을 인스타에 올려서 자신만의 그림 커리어를 만들고 있으시네요.
            많은 금손을 보고는 좌절하기도 하지만 그림을 시간과의 싸움인거 같습니다. 얼마나 오래 그리는지에 따라서 자신의 능력도 차근차근 발전하실 수 있습니다.
            가끔의 휴식을 통해 지금까지 쌓아온 불안감 가득했던 마음은 비우고, 열정으로 한가득 채워넣을 수 있을 것입니다. 
            당신의 친구들은 당신의 그림을 보며 충분히 잘그린다고 생각하며 언제나 당신의 작품이 잘나오기를 응원할 것입니다.  
        """
    elif hashtag == "낚시":
        message = """
            손 맛을 아는 당신! SNS의 강태공네요. 
            낚시와 관련된 태그를 많이 남기는 당신이 느끼는 물고기를 잡을 때의 그 벅찬 감정을 친구들도 함께 공유했으면 좋을거 같다는 생각을 가지고 있으시군요.  
            주변에 낚시를 즐기는 친구가 있다면 그 친구와는 천생연분이겠군요. 낚시가 취미가 아닌 친구가 있어도 잡아온 고기를 나눠먹으며 돈독한 우정을 쌓아가고 있으시군요. 
            가끔의 기다림의 묘미를 아는 당신은 무슨일을 해도 충분히 기다릴수 있고 성공해낼것입니다. 
            당신의 낚시에서도 대박을 치는 날이 있듯이 꾸준히 도전을 하면 언젠가는 인생에서도 대박을 칠 수 있을 것입니다.  
        """
    elif hashtag == "다이어트그램":
        message = """
            #다이어트 성공 #복근 #애플힙, 
            다이어트와 관련된 태그를 많이 남기는 당신은 언제나 살과의 전쟁 중이시군요. 
            일년 365일을 다이어트를 하며 먹고싶은 거를 자제하다보면 자신도 모르는세에 신경이 곤두서기 마련입니다. 한달에 한번은 자신을 위해 작은 치킹데이를 하시는건 어떠신가요? 
            자신을 가꾸기 위해 매일을 노력하는 당신 지금의 마음가짐을 잃지 않으신다면 자신이 원하는 것을 모두 이룰실겁니다. 
        """
    elif hashtag == "데일리코디":
        message = """
            항상 자신의 옷차림을 신경쓰는 당신 패션리더군요! 
            패션, 코디와 관련된 태그를 많이 남기는 당신은 언제나 무슨옷을 입을지 생각하시는 군요. 
            옷장이 가득차 있지만 항상 입을 옷이 없어서 항상을 고민하시는 당신 언제나 새로운 것을 시도하고 자신만의 색으로 풀어내는 능력도 탁월하시군요. 
            당신의 친구들은 어떠한 조건 속에서도 당신의 매력을 다른사람에게 어필할 수 있을 것입니다. 
        """
    elif hashtag == "등산스타그램":
        message = """
            정산에 올라가서 외쳐보세요. 무!야!호~! 
            등산과 관련된 태그를 많이 남기는 당신은 활동적인 운동을 좋아하시는군요. 
            항상 새로운 산을 정복하면서 새로운 도전을 하는 당신의 도전적인 정신은 사회생활을 할때 큰 도움이 될것입니다. 
            산을 오르면서 평소에 쌓였던 걱정거리를 날려버리는 것은 어떠신가요? 
            혼자가는 등산도 함께가는 등산도 당신과 함께 라면 당신은 모든 사람들의 든든한 길잡이가 되어줄 것입니다. 
        """
    elif hashtag == "럽스타그램":
        message = """
            연인과의 기록을 남기는 당신은 이시대의 사랑꾼! 
            럽스타그램 태그를 많이 남기는 당신은 언제나 상대방과의 행복한 순간을 남기는데 몰두하시는군요. 
            연애를 하며 힘든 상황에서도 상대방의 좋은 면만을 바라보며 긍정적이고 더 나은 상황을 만들고자 노력하는 사람이 되면 상대방과의 행복한 시간이 더욱 길어질 것입니다. 
            당신의 인스타그램에서 부러워하는 솔로들 우는 소리 들리는군요. 
        """
    elif hashtag == "뮤직스타그램":
        message = """
            MuZik is my Life….☆ 인스타 DJ로 임명합니다. 
            음악과 관련된 태그를 많이 남기는 당신은 자신의 음악 취향이 명확하시군요. 
            나라에서 허락한 유일한 마약인 음악을 즐기는 당신 힘들날에도 당신이 듣는 음악들 처럼 밝은 미래가 있을 것이고 행복한 날에는 밝은 노래를 통해 그 행복한 감정을 길게 기억하실 수 있을 것입니다. 
            음악이라는 좋은 친구와 하루를 즐겁게 보내네요. 당신의 좋은 친구와 같은 플레이리스트를 주변 사람들과 들어보는건 어떨까요? 
        """
    elif hashtag == "반려동물":
        message = """
            나는야 집사. 우리 주인님이 제일 귀여워 아파트뿌셔 지구뿌셔!!! 
            반려동물과 관련된 태그를 많이 남기는 당신은 언제나 당신의 사랑스러운 반려동물을 자랑하고 싶으시군요. 
            집에 사람이 없는 날에는 빨리 퇴근해서 집에 가서 당신을 기다릴 반려동물 생각에 걱정인 정도로 당신은 반려동물을 많이 사랑하고 아끼시는 군요. 
            반려동물 게시글을 많이 올리는것 같다면 걱정마세요 당신의 주변 사람들은 더 많은 반려동물의 게시글을 기대하고 있을 것입니다. 
            지친 하루를 되돌아오면 언제나 당신을 반갑게 맞아주는 반려동물은 당신의 삶에 있어서도 큰 친구가 될 것입니다. 
        """
    elif hashtag == "뷰티스타그램":
        message = """
            10살은 어려보인다. 어디 화장품쓰니 완전 궁금해! 
            뷰티와 관련된 태그를 많이 남기는 당신의 화장품 관련해서 관심이 많으시군요. 
            매 시즌마다 넘쳐나는 화장품의 후기를 비교하고 자신에게 맞는 화장품을 잘아는 당신은 10년이 지나도 20년이 지나도 뽀송뽀송한 피부를 가질 수 있을 것입니다. 
            당신의 친구들도 화장품에 관심이 많은 당신 덕분에 좋은 화장품을 쉽게 알아갈수 있을것입니다. 
        """
    elif hashtag == "셀카":
        message = """
            어? 예쁘다,,,  
            셀카와 관련된 태그를 많이 남기는 당신은 셀카를 찍을 때에는 확실하게 찍으시는군요. 
            당신은 자신의 아름다운 모습을 알고 있으므로 다른 사람의 아름다운 모습도 누구보다 빠르게 캐치를하고 그 모습을 사진에 담아 낼 수 있는 능력을 가지고 있으십니다. 
            가끔 실제 모습과 사진이 다르다고 셀기꾼이라고 욕하는 사람들에게 이렇게 말해주세요 오렌지 주스도 오렌지가 3% 들어가면 오렌지 주스입니다. 사진도 당신이 3%들어갔으면 당신의 사진임이 분명합니다. 
        """
    elif hashtag == "여행":
        message = """
            항상 떠날 준비가 되어있는 당신. 여행 중에도 다음 여행지를 생각하는 당신은 프로 여행자시군요.  
            여행과 관련된 태그를 많이 남기는 당신은 매번 새로운 장소에 가서도 빠르게 적응하는 모습을 가지고 있으시네요. 
            무계획 여행에서는 주어진 상황을 즐길줄 아는 모습을 보여주고, 계획된 여행에서는 그 여행지에 대해서 누구보다 완벽하게 알아가려는 모습이 인상깊습니다. 
            당신과 함께 여행을 떠나는 친구들은 무인도로 떠나도 즐거운 여행이 될 것 같습니다. 
        """
    elif hashtag == "음식":
        message = """
            최근에 박사학위 따셨다면서요…? 쩝쩝박사. 
            음식과 관련된 태그를 많이 남기는 당신은 맛있는 음식을 먹고 사진을 남기는 것을 좋아하시는군요. 
            당신은 약속이 어디에서 만날지 정해지면 하루종일 그주변의 맛집을 탐색하고 가게홍보글을 거를 수 있는 예리함을 가지셨군요. 
            친구들은 당신과 약속이 잡히면 어디로 갈지 매번 약속이 기다려 질 것입니다. 당신의 친구들이 부러워요! 
        """
    elif hashtag == "인테리어":
        message = """
            인테리어 척척박사! 
            인테리어와 관련된 태그를 많이 남기는 당신은 집에서 많은 시간을 보내시는군요. 
            당신이 상상하는 집을 꾸미기 위해 당신은 많은 많은 노력을 하시네요. 하나하나 직접 선택한 당신의 집은 당신만이 가지고 있는 매력을 100% 담은 집임이 분명합니다. 
            집을 꾸밀때의 세심함이 주변사람들을 대함에 있어서도 분명 드러날 것입니다. 추억으로 가득 채운 내 공간을 앞으로도 소중한 기억들로 채워가길 바래요. 
        """
    elif hashtag == "일상":
        message = """
            소소한 일상이 주는 소중함 
            일상과 관련된 태그를 많이 남기는 당신은 자신이 느기는 감정을 주변사람에게 공유하시는군요. 
            당신이 올리는 글들은 특별한 글은 아니지만 당신이란 사람에 대해서 알아갈 수 있는 글이 대부분입니다. 
            당신의 친구들도 글을 보며 충분히 공감하고 당신의 소소함에 물들어 가고 있을 것입니다. 
        """
    elif hashtag == "책스타그램":
        message = """
            책을 즐길줄 아는 당신! 짧은 순간도 허투루 보내지 않고 사색을 즐기시는군요. 
            책과 관련된 태그를 남기는 당신은 다른 사람이 쓴글에도 공감할 수 있고 이해력도 뛰어나십니다. 
            책을 읽으며 상황을 이해하고 공감할 수 있는 모습은 친구들에게도 마찬가지일 것입니다. 
            당신의 주변사람들과 마음의 양식인 책을 나누며 토론을 하시다보면 당신에게 쌓이는 지식이 더욱 많아질 것입니다. 
        """
    elif hashtag == "취미":
        message = """
            삶을 즐길줄 아는 당신! 짧은 순간도 허투루 보내지 않으시군요? 
            취미 태그를 많이 남기는 당신은 시간이 생기면 언제나 알차게 보내려 노력하는 사람이군요. 
            작은 시간이지만 자신이 만족할 일을 찾고 실행하는 당신의 모습이 삶을 더 윤택하게 만드는것 같습니다. 
            당신의 주변사람들은 당신이 하고 있는 취미에 관심이 생겼을 것 같습니다. 친구에게 함께 취미활동을 해보자고 제안해 보는건 어떠세요?
        """
    elif hashtag == "카페스타그램":
        message = """
            우유.. 좋아해요? 나도 우유 좋아하는데 아이럽우유♡ 
            카페와 관련된 태그를 많이 남기는 당신은 각 지역의 새로운 카페를 도전하는 카페탐험가시군요. 
            카페에서 눈을 감으면 들려오는 백색소음과 커피향기는 당신이 카페를 좋아하는 이유일것 같습니다. 같이가는 사람과 함께라면 당신의 기쁨은 몇배로 더커지겠지요 
            주변사람들도 당신과 함께 가는 카페에서 느낄수 있는 안정감을 사랑합니다. 앞으로 당신이갈 많은 카페가 궁금해집니다. 
        """
    elif hashtag == "캠핑그램":
        message = """
            자연속의 낭만을 즐기는 사람. 
            캠핑과 관련된 태그를 많이 남기는 당신은 집에서 쉬는것 보다는 밖에나가 자연과 함께 쉬는걸 즐기시는군요. 
            힘든 일상에 치여 바쁘게만 살아오던 당신의 힐링타임은 바로 캠핑이 아닐가요? 색다른 곳에서 차려 먹는 식사도 캠핑의 즐거운 점이죠.
            당신이 가는 캠핑은 혼자가도 운치 있을 것이고 다른 사람과 함께하면 몇배로 재밌을 것입니다. 
        """
    elif hashtag == "풍경":
        message = """
            일상속 자연에서 얻는 안정감. 
            풍경과 관련된 태그를 많이 남기는 당신은 일상속에서 볼 수 있는 아름다움을 남들보다 빠르게 캐치하시는군요. 
            당신의 태도는 아무리 힘든일이 있더라도 주변의 아름다움을 보고 극복할 수 있는 힘이 될 것입니다.  
            당신이 좋아하는 사람과 함께라면 더 아름다울 풍경이 그려지네요 앞으로도 그런 당신의 모습을 잃지마세요. 
        """
    elif hashtag == "헬스타그램":
        message = """
            내가 누워야 할 곳은 벤치프레스다. 
            헬스와 관련된 태그를 많이 남기는 당신은 지금 운동에 푹빠져있으시군요. 
            목표를 정했으면 꾸준히 노력하는 당신의 모습을 보고 다른사람들도 평소보다 열심히하는군요 
            힘들지만 열심히 노력하는 당신의 성실함과 꾸준함이 목표를 달성하는데 큰 힘이 되며 성공을 가져올꺼에요.  
            근손실보다는 차라리 통장에서 돈 빠져나가는게 났다는 당신 오늘도 득근하세요! 
        """
    else:
        message = """
            Oh Are you a foreigner? 
            I can't understand what you say. 
            I'm still using a translator. 
            Wait for us to develop a lot of service 🙏 
        """


    return message

def getSentimentMessage(sentiment):
    if sentiment == "긍정적":
        message = """
            언제나 밝게 소통을 하는 당신의 모습은 주변사람들도 밝게 만들어줍니다. 
            주변사람들이 힘든일이 있으면 가장먼저 응원해줄 수 있는 사람인 당신은 주변이 힘들어도 이겨낼 수 있는 강한 사람입니다. 
            당신의 긍정적인 모습이 앞으로를 지금보다 더 밝고 힘차게 만들어 줄 것 입니다. 이런 당신의 모습은 주변사람들에게도 큰 힘이 됩니다. 
        """
    elif sentiment == "부정적":
        message = """
            우울한 날에도 소통을 하려 노력하는 당신의 모습은 앞으로 어떤 힘든일이 있어도 이겨낼 수 있을 것입니다. 
            또한 당신이 힘든날에도 사정을 묻고 공감해주는 주변사람이 있으므로 너무 혼자 견뎌내려 하시지 않으셔도 괜찮습니다. 
            인생에는 힘든날도 있으면 좋은날도 반드시 존재합니다. 미래를 힘차게 살아가려는 당신의 모습이 좋은날을 더 빠르게 만나게 만들것 입니다.
        """

    return message

if __name__ == '__main__':
    hashtag = "가족"
    emo = "부정적"

    hashtagMessage = getHashtagMessage(hashtag)
    sentimentMessage = getSentimentMessage(emo)

    print(hashtagMessage)